#### Pandas-DataFrame And Series
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [15]:
%pip install pandas

Requirement already satisfied: pandas in d:\udemy\complete-python-bootcamp-main\10-data analysis with python\venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in d:\udemy\complete-python-bootcamp-main\10-data analysis with python\venv\lib\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\udemy\complete-python-bootcamp-main\10-data analysis with python\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\udemy\complete-python-bootcamp-main\10-data analysis with python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\udemy\complete-python-bootcamp-main\10-data analysis with python\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\udemy\complete-python-bootcamp-main\10-data analysis with python\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [16]:
## Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [17]:
## create a series from dicitionary
data={'a':1,'b':2,'c':3,'d':4,'e':5,'f':6}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [18]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [20]:
## Dataframe
## create a dataframe from a dicitionary of list 

data={
    'Name':['Sumit','Arpita','Deepak'],
    'Age':[22,21,23],
    'City':['kolhapur','Pune','USA']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age      City
0   Sumit   22  kolhapur
1  Arpita   21      Pune
2  Deepak   23       USA
<class 'pandas.core.frame.DataFrame'>

In [21]:
import numpy as np
np.array(df)

array([['Sumit', 22, 'kolhapur'],
       ['Arpita', 21, 'Pune'],
       ['Deepak', 23, 'USA']], dtype=object)

In [22]:
## Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Sumit','Age':22,'City':'USA'},
    {'Name':'John','Age':24,'City':'sangli'},
    {'Name':'arpita','Age':43,'City':'pune'},
    {'Name':'tulika','Age':32,'City':'pune'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age    City
0   Sumit   22     USA
1    John   24  sangli
2  arpita   43    pune
3  tulika   32    pune
<class 'pandas.core.frame.DataFrame'>

In [23]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [24]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card
240,10197,2024-07-15,Beauty Products,Tom Ford Black Orchid Perfume,1,125.00,125.00,Europe,PayPal
241,10198,2024-07-16,Sports,GoPro HERO9 Black,1,449.99,449.99,Asia,Credit Card
242,10199,2024-07-17,Electronics,Apple TV 4K,2,179.00,358.00,North America,Credit Card
243,10200,2024-07-18,Home Appliances,Instant Pot Duo Nova,1,99.95,99.95,Europe,PayPal

In [25]:
## Accessing Data From Dataframe
data

[{'Name': 'Sumit', 'Age': 22, 'City': 'USA'},
 {'Name': 'John', 'Age': 24, 'City': 'sangli'},
 {'Name': 'arpita', 'Age': 43, 'City': 'pune'},
 {'Name': 'tulika', 'Age': 32, 'City': 'pune'}]

In [26]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card
240,10197,2024-07-15,Beauty Products,Tom Ford Black Orchid Perfume,1,125.00,125.00,Europe,PayPal
241,10198,2024-07-16,Sports,GoPro HERO9 Black,1,449.99,449.99,Asia,Credit Card
242,10199,2024-07-17,Electronics,Apple TV 4K,2,179.00,358.00,North America,Credit Card
243,10200,2024-07-18,Home Appliances,Instant Pot Duo Nova,1,99.95,99.95,Europe,PayPal

In [27]:
df['Name']

KeyError: 'Name'

In [ ]:
type(df['Name'])

pandas.core.series.Series

In [ ]:
df.loc[1]

Name    Arpita
Age         21
City      Pune
Name: 1, dtype: object

In [ ]:
df.iloc[0]

Name       Sumit
Age           22
City    kolhapur
Name: 0, dtype: object

In [ ]:
df.iloc[0][0]

C:\Users\deepa\AppData\Local\Temp\ipykernel_30464\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Sumit'

In [ ]:
df

     Name  Age      City
0   Sumit   22  kolhapur
1  Arpita   21      Pune
2  Deepak   23       USA

In [ ]:
## accessing a specified element

df['Name']

0     Sumit
1    Arpita
2    Deepak
Name: Name, dtype: object

In [ ]:
## accessing a specified element

df.at[0,'Age']

np.int64(22)

In [ ]:
df.at[2,'Name']

'Deepak'

In [ ]:
## accessing a specified element using iat

df.iat[2,2]

'USA'

In [ ]:
df

     Name  Age      City
0   Sumit   22  kolhapur
1  Arpita   21      Pune
2  Deepak   23       USA

In [ ]:
### Data MAnipulation with Dataframe
df

     Name  Age      City
0   Sumit   22  kolhapur
1  Arpita   21      Pune
2  Deepak   23       USA

In [ ]:
## Adding a column
df['salary']=[50000,20000,70000]

In [ ]:
df

     Name  Age      City  salary
0   Sumit   22  kolhapur   50000
1  Arpita   21      Pune   20000
2  Deepak   23       USA   70000

In [ ]:
## remove a column

df.drop('salary',axis=1,inplace=True)

In [ ]:
df

     Name  Age      City
0   Sumit   22  kolhapur
1  Arpita   21      Pune
2  Deepak   23       USA

In [ ]:
## add age to the column 
df['Age']=df['Age']+1

In [ ]:
df

     Name  Age      City
0   Sumit   23  kolhapur
1  Arpita   22      Pune
2  Deepak   24       USA

In [ ]:
df.drop(0,inplace=True)

In [ ]:
df

     Name  Age  City
1  Arpita   22  Pune
2  Deepak   24   USA

In [ ]:
df=pd.read_csv('sales_data.csv')
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [ ]:
# Display the data types of each column
print("Data types:\n", df.dtypes)

# Describe the DataFrame
print("Statistical summary:\n", df.describe())

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [ ]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000